In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [5]:
df1 = DataFrame(np.arange(9).reshape(3,3), index=['BJ','SH','GZ'], columns=['A','B','C'])

In [6]:
df1

    A  B  C
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [7]:
df1.index = Series(['bj','sh','gz'])

In [8]:
df1

    A  B  C
bj  0  1  2
sh  3  4  5
gz  6  7  8

In [10]:
df1.index = df1.index.map(str.upper)
df1

    A  B  C
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [12]:
df1.rename(index = str.lower, columns = str.lower)

    a  b  c
bj  0  1  2
sh  3  4  5
gz  6  7  8

In [18]:
df1.rename(index = {'BJ': 'beijing'}, columns={'A':'a'})

         a  B  C
beijing  0  1  2
SH       3  4  5
GZ       6  7  8

In [19]:
df1

    A  B  C
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [24]:
list1 = [1,2,3,4]
list2 = list(map(str, list1))

In [25]:
list2

['1', '2', '3', '4']

In [26]:
def test_map(x):
    return x + '_ABC'
df1.index.map(test_map)

Index(['BJ_ABC', 'SH_ABC', 'GZ_ABC'], dtype='object')

In [27]:
df1

    A  B  C
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [28]:
df1.rename(index=test_map)

        A  B  C
BJ_ABC  0  1  2
SH_ABC  3  4  5
GZ_ABC  6  7  8